B2BGITVersion/BookingAPIFiles/ChangesDeailsInAlreadyExitsinBooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.juniper.es/webservice/2007/">
  <soapenv:Header/>
  <soapenv:Body>
    <HotelModify>
      <HotelModifyRQ Version="1.1" Language="en">
        <Login Email="user@mydomain.com" Password="pass"/>
        <ReservationLocator ItemId="123456">XXXXXX</ReservationLocator>
        <Comments>
          <Comment Type="RES">1234</Comment>
        </Comments>
      </HotelModifyRQ>
    </HotelModify>
  </soapenv:Body>
</soapenv:Envelope>